; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_3 ?v1 - type_3 ?v8 - type_1)
 	      (pred_1 ?v7 - object ?v8 - type_1)
	      (pred_2 ?v1 - type_3 ?v2 - type_2)
	      (pred_4 ?v1 - type_3 ?v7 - object ?v2 - type_2))

   (:action op_1
       :parameters  (?v1 - type_3 ?v6 ?v3 - type_1)
       :precondition (and  (pred_3 ?v1 ?v6))
       :effect (and  (pred_3 ?v1 ?v3)
		     (not (pred_3 ?v1 ?v6))))

   (:action op_2
       :parameters (?v1 - type_3 ?v5 - object ?v4 - type_1 ?v2 - type_2)
       :precondition  (and  (pred_1 ?v5 ?v4) (pred_3 ?v1 ?v4) (pred_2 ?v1 ?v2))
       :effect (and (pred_4 ?v1 ?v5 ?v2)
		    (not (pred_1 ?v5 ?v4)) 
		    (not (pred_2 ?v1 ?v2))))

   (:action op_3
       :parameters (?v1 - type_3 ?v5 - object ?v4 - type_1 ?v2 - type_2)
       :precondition  (and  (pred_4 ?v1 ?v5 ?v2) (pred_3 ?v1 ?v4))
       :effect (and (pred_1 ?v5 ?v4)
		    (pred_2 ?v1 ?v2)
		    (not (pred_4 ?v1 ?v5 ?v2)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_08 obj_07 - type_3
obj_04 obj_03 obj_02 obj_12 - type_2
obj_01 obj_11 obj_10 obj_05 - type_1
obj_14 obj_13 obj_06 obj_09 - object)
(:init
(pred_3 obj_08 obj_01)
(pred_2 obj_08 obj_04)
(pred_2 obj_08 obj_03)
(pred_3 obj_07 obj_05)
(pred_2 obj_07 obj_02)
(pred_2 obj_07 obj_12)
(pred_1 obj_14 obj_01)
(pred_1 obj_13 obj_10)
(pred_1 obj_06 obj_11)
(pred_1 obj_09 obj_05)
)
(:goal
(and
(pred_1 obj_14 obj_01)
(pred_1 obj_13 obj_01)
(pred_1 obj_06 obj_01)
(pred_1 obj_09 obj_01)
)
)

(:constraints
  (always (not (pred_3 obj_08 obj_10)))
)
)

; plan
1. (op_2 obj_07 obj_09 obj_05 obj_12)
   deleted: (pred_1 obj_09 obj_05) (pred_2 obj_07 obj_12)
   added: (pred_4 obj_07 obj_09 obj_12)
   goals met: 1 of 4
2. (op_1 obj_08 obj_01 obj_11)
   deleted: (pred_3 obj_08 obj_01)
   added: (pred_3 obj_08 obj_11)
   goals met: 1 of 4
3. (op_1 obj_07 obj_05 obj_01)
   deleted: (pred_3 obj_07 obj_05)
   added: (pred_3 obj_07 obj_01)
   goals met: 1 of 4
4. (op_2 obj_08 obj_06 obj_11 obj_03)
   deleted: (pred_1 obj_06 obj_11) (pred_2 obj_08 obj_03)
   added: (pred_4 obj_08 obj_06 obj_03)
   goals met: 1 of 4
5. (op_3 obj_07 obj_09 obj_01 obj_12)
   deleted: (pred_4 obj_07 obj_09 obj_12)
   added: (pred_1 obj_09 obj_01) (pred_2 obj_07 obj_12)
   goals met: 2 of 4
6. (op_1 obj_08 obj_11 obj_01)
   deleted: (pred_3 obj_08 obj_11)
   added: (pred_3 obj_08 obj_01)
   goals met: 2 of 4
7. (op_3 obj_08 obj_06 obj_01 obj_03)
   deleted: (pred_4 obj_08 obj_06 obj_03)
   added: (pred_1 obj_06 obj_01) (pred_2 obj_08 obj_03)
   goals met: 3 of 4
8. (op_1 obj_07 obj_01 obj_10)
   deleted: (pred_3 obj_07 obj_01)
   added: (pred_3 obj_07 obj_10)
   goals met: 3 of 4
9. (op_2 obj_07 obj_13 obj_10 obj_12)
   deleted: (pred_1 obj_13 obj_10) (pred_2 obj_07 obj_12)
   added: (pred_4 obj_07 obj_13 obj_12)
   goals met: 3 of 4
10. (op_1 obj_07 obj_10 obj_01)
   deleted: (pred_3 obj_07 obj_10)
   added: (pred_3 obj_07 obj_01)
   goals met: 3 of 4
11. (op_3 obj_07 obj_13 obj_01 obj_12)
   deleted: (pred_4 obj_07 obj_13 obj_12)
   added: (pred_1 obj_13 obj_01) (pred_2 obj_07 obj_12)
   goals met: 4 of 4
